pimpleScalarFoam/TestCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    WALL_L
    {
        type            cyclic;
    }
    WALL_R
    {
        type            cyclic;
    }
    SLIP
    {
        type            slip;
    }
    WALL_BOTTOM
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
