pimpleScalarFoam/TestCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleScalarFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          5e-8;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      30;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

functions
{
	fieldAverage1
	{
	type            fieldAverage;
	libs            (fieldFunctionObjects);
	writeControl    writeTime;
		fields
		(
		    U
		    {
			mean        on; //
			prime2Mean  on;
			base        time;
		    }
		    p
		    {
			mean        off;
			prime2Mean  off;
			base        time;  //
		    }
		    T_passive
		    {
			mean        on;   // 
			prime2Mean  off;  // 
			base        time;
		    }
		);
	}
	wallShearStress1
	{
		    // Mandatory entries
		    type            wallShearStress;
		    libs            (fieldFunctionObjects);
		    // Optional entries
		    patches          (WALLS);
		    // Optional (inherited) entries
		    writePrecision  10;
		    writeToFile     true;
		    useUserTime     true;

		    region          region0;
		    enabled         true;
		    log             true;
		    executeControl  timeStep;
		    executeInterval 1;
		    writeControl    writeTime;
		    writeInterval   -1;
	}
	Forces 
	{
		type forces; 
		libs ("libforces.so"); 
		origin              (0 0 0);
		e1                  (1 0 0);
		e3                  (0 0 1);
		patches (WALL_BOTTOM); 
		log true;
		rho rhoInf; 
		rhoInf 1.2; 
		dragDir (1 0 0); 
		writeControl    timeStep;
		writeInterval   5; 
	}
}


// ************************************************************************* //
