pimpleScalarFoam/TestCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  30;

method          scotch;


constraints
{
    preservePatches
    {
        type            preservePatches;
        patches         (INLET OUTLET WALL_L WALL_R);
    }
}

/*
coeffs
{
    n           (1 2 2);
}*/


// ************************************************************************* //
